Repository: brunoeiterer/CV
Catalog: BrunoEitererCVDesktopApp/BrunoEitererCV/Strings/Resources-*.resw
Source language: en_us
Languages: pt_br

# AboutMe.Greeting
source: Hi, I'm Bruno :)
pt_br: Olá, eu sou o Bruno :)

# AboutMe.NavigationViewItemContent
source: About Me
pt_br: Sobre mim

# AboutMe.Text
source: I'm a generalist software developer from Brazil. I have over <Bold>10 years</Bold> of experience in Software Development, with 6 years professionally and 4 year in an academic environment, working across <Bold>Embedded Systems</Bold>, <Bold>Web</Bold>, and <Bold>Desktop</Bold> Applications on an <Bold>Enterprise</Bold> level, focusing on backend development and the application logic, while also contributing to the frontend/user interface whenever needed. <LineBreak/> <LineBreak/> I use mainly <Bold>C#</Bold>, <Bold>C</Bold> and <Bold>C++</Bold>, complemented by experience with <Bold>Java</Bold>, <Bold>JavaScript</Bold>, <Bold>Typescript</Bold> and <Bold>Python</Bold>. I have also used multiple web and desktop frameworks, like <Bold>AspNet.Core</Bold>, <Bold>WCF</Bold>, <Bold>NextJS</Bold>, <Bold>WPF</Bold>, <Bold>WinUI 3</Bold> and <Bold>JavaFX</Bold>. <LineBreak/> <LineBreak/> I thrive in large, legacy codebases and enjoy solving complex problems regardless of the tech stack. <LineBreak/> <LineBreak/> I'm always eager to learn new things independently, using tutorials, documentation, books, AI and just trying things out. <LineBreak/> <LineBreak/> I also like to sharpen my skills with side projects. <Hyperlink Click="OnSideProjectsHyperlinkClick">Check them out!</Hyperlink>
pt_br: Sou um Desenvolvedor de Software generalista. Tenho mais de <Bold>10 anos</Bold> de experiência, sendo 6 anos profissionalmente e 4 anos em pesquisa acadêmica. Já trabalhei com <Bold>Sistemas Embarcados</Bold> e aplicações <Bold>Web</Bold> e <Bold>Desktop</Bold> em um nível <Bold>Empresarial</Bold>, focando no desenvolvimento backend e na lógica da aplicação, enquanto também contribuo com o frontend/interface do usuário quando necessário. <LineBreak/> <LineBreak/> Trabalho principalmente com <Bold>C#</Bold>, <Bold>C</Bold> e <Bold>C++</Bold>, e também tenho experiência com <Bold>Java</Bold>, <Bold>JavaScript</Bold>, <Bold>Typescript</Bold> e <Bold>Python</Bold>. Além disso, tenho experiência com vários frameworks para desenvolvimento web e desktop, como <Bold>AspNet.Core</Bold>, <Bold>WCF</Bold>, <Bold>NextJS</Bold>, <Bold>WPF</Bold>, <Bold>WinUI 3</Bold> e <Bold>JavaFX</Bold>. <LineBreak/> <LineBreak/> Eu lido bem com bases de código legado grandes, e gosto de resolver problemas complexos independentemente da tech stack. <LineBreak/> <LineBreak/> Estou sempre buscando aprender coisas novas, usando tutoriais, documentação, livros, IA e também fuçando e tentando fazer funcionar. <LineBreak/> <LineBreak/> Também gosto de aprimorar minhas habilidades com projetos pessoais. <Hyperlink Click="OnSideProjectsHyperlinkClick">Confira eles aqui!</Hyperlink>

# Education.NavigationViewItemContent
source: Education
pt_br: Educação

# Languages.NavigationViewItemContent
source: Languages
pt_br: Línguas

# ProfessionalExperience.NavigationViewItemContent
source: Professional Experience
pt_br: Experiência Profissional

# Programming.NavigationViewItemContent
source: Programming
pt_br: Programação

# RDI.SeniorSoftwareDeveloper.Text
source: • Full-Stack Development: Development of McDonald’s restaurant applications that process <Bold>millions of orders daily</Bold>, utilizing <Bold>C#</Bold>, <Bold>C++</Bold>, <Bold>C</Bold> and <Bold>JavaScript</Bold> with <Bold>RavenDB (NoSQL)</Bold> to ensure robust and reliable software solutions.<LineBreak /> • Critical Issue Resolution: Addressed high-priority issues, including production incidents, reducing average root cause analysis and resolution times by 40%.<LineBreak /> • Leadership &amp; Expertise: Acted as a dev lead and subject matter expert on demand, guiding teams through complex challenges and contributing valuable insights to enhance product quality.<LineBreak /> • International Collaboration: Worked closely with global teams and stakeholders to address diverse project requirements, ensuring alignment across time zones and delivering solutions that meet international standards.
pt_br: • Desenvolvimento Full-Stack: Desenvolvimento de aplicações para restaurantes McDonald’s, que processam <Bold>milhões de pedidos diariamente</Bold>, usando <Bold>C#</Bold>, <Bold>C++</Bold>, <Bold>C</Bold> e <Bold>JavaScript</Bold> com <Bold>RavenDB (NoSQL)</Bold> garantindo soluções robustas e confiáveis.<LineBreak /> • Resolução de problemas críticos: Atuação em bugs de alta prioridade, incluindo incidentes em produção, reduzindo o tempo médio de análise de causa raíz e resolução em 40%.<LineBreak /> • Liderança &amp; Expertise: Atuação como líder de desenvolvimento e especialista em tópicos específicos sob demanda, orientando equipes em desafios complexos e contribuindo com insights valiosos para aprimorar a qualidade do produto.<LineBreak /> • Colaboração Internacional: Trabalho em colaboração com equipes e stakeholders globais para atender a requisitos diversos de projetos, garantindo alinhamento entre fusos horários e entregando soluções que atendem aos padrões internacionais.

# RDI.SeniorSoftwareDeveloper.Title
source: Senior Software Developer
pt_br: Desenvolvedor de Software Sênior

# RDI.SoftwareDevelopmentConsultant.Title
source: Software Development Consultant
pt_br: Consultor de Desenvolvimento de Software

# RDI.SoftwareDevelopmentConsultant.Text
source: • In-House Development: Collaborated with international teams as an in-house consultant, working on core applications for McDonald’s using <Bold>C#</Bold>, <Bold>C++</Bold>, <Bold>C</Bold>, and <Bold>JavaScript</Bold>.<LineBreak /> • Problem-Solving &amp; Reliability: Tackled critical issues and production incidents with efficiency, establishing a track record for reducing response times and enhancing application reliability.<LineBreak /> • Foundation for Full-Time Role: Built a strong working relationship with RDI Software by consistently delivering high-quality solutions, which led to a direct hire as a Senior Software Developer.
pt_br: • Desenvolvimento Interno: Colaboração com equipes internacionais como consultor interno, trabalhando em aplicações para o McDonald's utilizando <Bold>C#</Bold>, <Bold>C++</Bold>, <Bold>C</Bold>, e <Bold>JavaScript</Bold>.<LineBreak /> • Solução de Problemas e Confiabilidade: Atuação em bugs críticos e incidentes de produção com eficiência, estabelecendo um histórico de redução de tempos de resposta e aumento da confiabilidade das aplicações.<LineBreak /> • Base para Contratação Efetiva: Construção de uma forte relação de trabalho com a RDI Software, entregando consistentemente soluções de alta qualidade, o que levou à contratação direta como Desenvolvedor de Software Sênior.

# SideProjects.NavigationViewItemContent
source: Side Projects
pt_br: Projetos Pessoais

# Skills.NavigationViewItemContent
source: Skills
pt_br: Habilidades

# Gertec.MiddleSoftwareDeveloper.Title
source: Middle Software Developer
pt_br: Desenvolvedor de Software Pleno

# Gertec.MiddleSoftwareDeveloper.Text
source: • Embedded Systems Development: Focused on developing and optimizing software for credit card machines that process <Bold>millions of transactions daily</Bold>, primarily on <Bold>Embedded Linux</Bold> using <Bold>C</Bold> and <Bold>C++</Bold>. Ensured high reliability and performance, critical for secure transaction processing.<LineBreak /> • Desktop Applications: Development of desktop applications in <Bold>C#</Bold> and <Bold>WPF</Bold>, enhancing internal tools with improved functionality and user experience.<LineBreak /> • Web Applications: Development of web applications for <Bold>Jira</Bold> and <Bold>Confluence</Bold> using <Bold>Java</Bold> and <Bold>Spring Boot</Bold>.<LineBreak /> • Secondary Responsibilities: Contributed to select <Bold>Android</Bold> and <Bold>Java</Bold>-based features.
pt_br: • Desenvolvimento de Sistemas Embarcados: Desenvolvimento e otimização de software para máquinas de cartão de crédito que processam <Bold>milhões de transações diariamente</Bold>, principalmente em <Bold>Linux Embarcado</Bold> usando <Bold>C</Bold> e <Bold>C++</Bold>.<LineBreak/> • Aplicações Desktop: Desenvolvimento de aplicações desktop em <Bold>C#</Bold> e <Bold>WPF</Bold>, aprimorando ferramentas internas com melhor funcionalidade e experiência do usuário.<LineBreak /> • Aplicações Web: Desenvolvimento de aplicações Web para <Bold>Jira</Bold> e <Bold>Confluence</Bold> usando <Bold>Java</Bold> e <Bold>Spring Boot</Bold>.<LineBreak /> • Responsabilidades Secundárias: Contribuição em algumas funcionalidades baseadas em <Bold>Android</Bold> e <Bold>Java</Bold>.

# Gertec.SoftwareDeveloper.Title
source: Software Developer
pt_br: Desenvolvedor de Software

# Gertec.SoftwareDeveloper.Text
source: • Linux-Based Credit Card Systems: Development of <Bold>Embedded Linux</Bold> systems with a primary focus on <Bold>C</Bold> and <Bold>C++</Bold> to ensure stable, efficient software for secure payment processing.<LineBreak /> • Desktop Development: Created and maintained internal desktop applications in <Bold>C#</Bold> and <Bold>WPF</Bold>, optimizing features for end-user productivity.
pt_br: • Sistemas de Cartão de Crédito Baseados em Linux: Desenvolvimento de sistemas em <Bold>Linux Embarcado</Bold> com foco principal em <Bold>C</Bold> e <Bold>C++</Bold> para garantir software estável e eficiente no processamento seguro de pagamentos.<LineBreak /> • Desenvolvimento Desktop: Desenvolvimento de aplicações desktop em <Bold>C#</Bold> e <Bold>WPF</Bold>, otimizando funcionalidades para maior produtividade do usuário final.

# Freelance.SoftwareDeveloper.Title
source: Software Developer
pt_br: Desenvolvedor de Software

# Freelance.SoftwareDeveloper.Text
source: Development of a Desktop app using <Bold>Java</Bold> and <Bold>JavaFX</Bold> for results calculation for small companies, with the following features:<LineBreak/> • Patrimony Control.<LineBreak/> • Chart of Accounts.<LineBreak/> • Monthly and yearly results calculation.<LineBreak/> • Comparison of results.<LineBreak/> • Support for printing or exporting the results to Excel and PDF.
pt_br: Desenvolvimento de uma aplicação Desktop em <Bold>Java</Bold> e <Bold>JavaFX</Bold> para apuração de resultado para MPE, com as seguintes funcionalidades:<LineBreak/> • Controle Patrimonial.<LineBreak/> • Plano de Contas.<LineBreak/> • Apuração de Resultado mensal e anual.<LineBreak/> • Comparação de Resultados.<LineBreak/> • Possibilidade de imprimir ou exportar o resultado para Excel e PDF.

# ASML.EmbeddedSoftwareIntern.Title
source: Embedded Software Intern
pt_br: Estagiário de Software Embarcado

# ASML.EmbeddedSoftwareIntern.Text
source: • Implementation of the EtherCAT protocol prototype in the Motion Control group in <Bold>C</Bold> and <Bold>C++</Bold>, both in <Bold>Linux</Bold> and <Bold>Bare-Metal</Bold>.<LineBreak /> • Implementation of test code in <Bold>Python</Bold>.<LineBreak /> • Successful integration of the protocol with existing code.<LineBreak /> • Development of getting started tutorials for new team members.
pt_br: • Implementação do protótipo do protocolo EtherCAT no grupo de Motion Control em <Bold>C</Bold> e <Bold>C++</Bold>, tanto em <Bold>Linux</Bold> como <Bold>Bare-Metal</Bold>.<LineBreak /> • Implementação do código de testes em <Bold>Python</Bold>.<LineBreak /> • Integração bem sucediade do protocolo com o código existente.<LineBreak /> • Desenvolvimento de tutoriais para novos membros do time.

# UFSC.Title
source: Federal University of Santa Catarina, Brazil
pt_br: Universidade Federal de Santa Catarina, Brasil

# UFSC.Text
source: Although I studied Electrical Engineering, I started to realize I like software development taking some classes on <Bold>C</Bold>, <Bold>C++</Bold> and <Bold>Microcontrollers</Bold>, learning <Bold>Assembly</Bold>.<LineBreak/> <LineBreak/> During my third year I had the opportunity to join the Floripa-Sat project, which developed the first Cubesat nanosatellite completely developed by students in Brazil. Completely developing the firmware for the Energy Power System from scratch I became sure software development was my passion and what I wanted to do in my career. My activities included:<LineBreak/> • Development of the firmware for the microcontroller and several other integrated circuits in <Bold>C</Bold>.<LineBreak/> • Usage of communication protocols (<Bold>I²C</Bold>, <Bold>SPI</Bold>, <Bold>UART</Bold>, <Bold>One-Wire</Bold>).<LineBreak/> • Implementation of <Bold>Maximum Power Point Tracking</Bold> algorithms.<LineBreak/> • Implementation of the <Bold>task scheduler</Bold>.<LineBreak/> • Development of the temperature control system for the nanosatellite batteries.<LineBreak/> • Development of the voltage and current measurement circuits using amplifiers and ADCs.<LineBreak/> • Development of the test methodology and its documentation.<LineBreak/> • Implementation of buck and boost switch-mode converters.<LineBreak/> • Solar panels, switch-mode converters and load modeling using <Bold>Matlab</Bold> and <Bold>Simscape</Bold>.<LineBreak/> • Participation in the project's hardware development.<LineBreak/> • All acitivities were executed under <Bold>Scrum</Bold> methodology.<LineBreak/> Find out more about the project at the <Hyperlink NavigateUri="https://floripasat.ufsc.br">Official Website</Hyperlink> and the <Hyperlink NavigateUri="https://github.com/floripasat">Official Github Repo</Hyperlink>.
pt_br: Embora eu tenha estudado Engenharia Elétrica, percebi que gosto de desenvolvimento de software durante disciplinas de <Bold>C</Bold>, <Bold>C++</Bold> e <Bold>Microcontroladores</Bold>, onde aprendi <Bold>Assembly</Bold>.<LineBreak/> <LineBreak/> Durante o terceiro ano da graduação tive a oportunidade de me juntar ao projeto Floripa-Sat, que teve como objetivo desenvolver o primeiro nanosatélite do tipo Cubesat desenvolvido 100% por estudantes no Brasil. Ao desenvolver todo o firmware para o Módulo de Energia do zero eu tive certeza que desenvolvimento de software é o que eu gosto de fazer e a carreira que queria seguir. Minhas atividades incluíram:<LineBreak/> • Desenvolvimento do firmware para o microcontrolador e diversos outros circuitos integrados em <Bold>C</Bold>.<LineBreak/> • Uso de protocolos de comunicação (<Bold>I²C</Bold>, <Bold>SPI</Bold>, <Bold>UART</Bold>, <Bold>One-Wire</Bold>).<LineBreak/> • Implementação de algortimos de <Bold>Rastreamento do Ponto de Máxima Potência (MPPT)</Bold>.<LineBreak/> • Implementação do <Bold>escalonador de tarefas</Bold>.<LineBreak/> • Desenvolvimento do sistema de controle de temperatura para as baterias do nanosatélite.<LineBreak/> • Desenvolvimento dos circuitos de medida de tensão e corrent usando amplificadores e ADCs.<LineBreak/> • Desenvolvimento da metodologia de testes e sua documentação.<LineBreak/> • Implementação de conversores chaveados buck e boost.<LineBreak/> • Modelagem dos painéis solares, conversores chaveados e da carga usando <Bold>Matlab</Bold> e <Bold>Simscape</Bold>.<LineBreak/> • Participação no desenvolvimento do hardware do projeto.<LineBreak/> • Todas as atividades foram executadas usando a metodologia <Bold>Scrum</Bold>.<LineBreak/> Conheça mais sobre o projeto no <Hyperlink NavigateUri="https://floripasat.ufsc.br">Site Oficial</Hyperlink> e no <Hyperlink NavigateUri="https://github.com/floripasat">Repositório Oficial no Github</Hyperlink>.

# English.Title
source: English
pt_br: Inglês

# English.Level
source: Advanced - Proficient in professional and casual settings.
pt_br: Avançado - Proficiência em ambientes profissionais e casuais.

# English.Text
source: • Used in all professional experiences for writing documentation, communicating with international suppliers, team members and stakeholders.<LineBreak/> • Used while living abroad in the Netherlands, both professionally and casually.
pt_br: • Usado em todas as minhas experiências profissionais para documentação, comunicação com fornecedores, times e stakeholders internacionais.<LineBreak/> • Usado enquanto morei na Holanda, tanto profissionalmente como casualmente.

# Portuguese.Title
source: Portuguese
pt_br: Português

# Portuguese.Level
source: Native, born in Brazil.
pt_br: Naitvo, sou Brasileiro.

# French.Title
source: French
pt_br: Francês

# French.Level
source: Basic reading and writing skills.
pt_br: Habilidades básicas de leitura e escrita.

# French.Text
source: • Learned through classes and self-study, but have not used professionally.
pt_br: • Aprendi em aulas e estudo próprio, mas nunca usei profissionalmente.

# CSharp.YearsOfExperience
source: 6 years of experience
pt_br: 6 anos de experiência

# CSharp.Text
source: I started learning C# independently through the <Hyperlink NavigateUri="https://www.robmiles.com/c-yellow-book">C# Yellow Book</Hyperlink> in 2019. <LineBreak/>It is my main language for new development at my current job at RDI, and I've used it for developing internal tooling at Gertec. <LineBreak/>I've also used it in several <Hyperlink Click="OnSideProjectsHyperlinkClick">Side Projects</Hyperlink>, like this CV app. <LineBreak/>I have experience using <Bold>WPF</Bold>, <Bold>WinUi 3</Bold>, <Bold>WCF</Bold> <Bold>.NET8</Bold>, <Bold>.NET framework 4.6.2</Bold> and <Bold>ASP.NET Core</Bold>.
pt_br: Comecei a estudar C# de forma independente através do <Hyperlink NavigateUri="https://www.robmiles.com/c-yellow-book">C# Yellow Book</Hyperlink> em 2019. <LineBreak/>É a minha linguagem principal para novos desenvolvimentos em meu emprego atual na RDI, e também já usei C# para desenvolvimento de ferramentas internas na Gertec. <LineBreak/>Também já usei C# em diversos <Hyperlink Click="OnSideProjectsHyperlinkClick">Projetos Pessoais</Hyperlink>, como esse CV. <LineBreak/>Tenho experiência com <Bold>WPF</Bold>, <Bold>WinUi 3</Bold>, <Bold>WCF</Bold> <Bold>.NET8</Bold>, <Bold>.NET framework 4.6.2</Bold> e <Bold>ASP.NET Core</Bold>.

# C.YearsOfExperience
source: 10 years of experience
pt_br: 10 anos de experiência

# C.Text
source: I first had contact with C in a course during my graduation back in 2012.<LineBreak/> Since then I've used it extensively in all my academic and professional experiences.
pt_br: Meu primeiro contato com C foi em um curso durante a minha graduação, em 2012. <LineBreak/>Desde então usei C em todas as minhas experiências acadêmicas e profissionais.

# Cpp.YearsOfExperience
source: 7 years of experience
pt_br: 7 anos de experiência

# Cpp.Text
source: I first had contact with the C++ for embedded systems course during my graduation back in 2018.<LineBreak/> Since then I've used it in all professional experiences.
pt_br: Meu primeiro contato com C++ foi durante um curso de C++ para sistemas embarcados durante a minha graduação, em 2018.<LineBreak/> Desde então usei C++ em todas as minhas experiências profissionais.

# Python.YearsOfExperience
source: 6 years of experience
pt_br: 6 anos de experiência

# Python.Text
source: I first started learning python through the book <Hyperlink NavigateUri="https://jakevdp.github.io/WhirlwindTourOfPython/">A Whirlwind Tour of Python</Hyperlink>. <LineBreak/>I don't use it as my main language for development, but I consistently use it for scripts and automations, like log processing and Bitbucket PR statistics.
pt_br: Eu comecei a estudar python através do livro <Hyperlink NavigateUri="https://jakevdp.github.io/WhirlwindTourOfPython/">A Whirlwind Tour of Python</Hyperlink>. <LineBreak/>Eu não uso Python como minha linguagem principal de desenvolvimento, mas uso constantemente para scripts e automações, como processamento de logs e levantamento de estatísticas de PR do Bitbucket.

# Javascript.YearsOfExperience
source: 4 years of experience
pt_br: 4 anos de experiência

# Javascript.Text
source: I use Javascript in a legacy localization layer at my current job at RDI. Although Javascript is tipically a frontend languange, this localization layer runs on the application backend.
pt_br: Eu uso Javascript em uma camada de localização no meu emprego atual na RDI. Embora Javascript seja usado predominantemente no frontend, essa camada faz parte do backend da aplicação.

# Typescript.YearsOfExperience
source: 4 years of experience
pt_br: 4 anos de experiência

# Typescript.Text
source: I use Typescript when working on the frontend at RDI. This is a more sporadic use, since my focus is on the backend. <LineBreak/>I have also used it on the frontend in <Hyperlink Click="OnSideProjectsHyperlinkClick">Side Projects</Hyperlink>.
pt_br: Eu uso Typescript quando trabalho no frontend na RDI. Esse trabalho é mais esporádico, já que meu foco é no backend. <LineBreak/>Também já usei typescript no frontend em <Hyperlink Click="OnSideProjectsHyperlinkClick">Projetos Pessoais</Hyperlink>.

# Java.YearsOfExperience
source: 3 years of experience
pt_br: 3 anos de experiência

# Java.Text
source: I have used Java to create Jira and Confluence plugins, and also to build a desktop application as a freelancer.
pt_br: Já usei Java para criar plugins para o Jira e Confluence, e também para fazer uma aplicação desktop como freelancer.

# Git.YearsOfExperience
source: 10 years of experience
pt_br: 10 anos de experência

# Git.Text
source: I started using Git roughly around the same time I started learning about software development in my graduation, and I've been using it in every professional experience since then. I'm proficient and comfortable using it.
pt_br: Comecei a usar Git praticamente no mesmo momento que comecei a aprender sobre desenvolvimento de software, e tenho usado em todas as minhas experiências profissionais desde então. Tenho proficiência e me sinto confortável com ele.

# GithubCopilot.YearsOfExperience
source: 1 year of experience
pt_br: 1 ano de experiência

# GithubCopilot.Text
source: I've been using Github Copilot at my current job at RDI, since it is the approved internal AI tool. I use it for code generation, both for production code (of course, it is reviewed by me before commiting) and internal tooling, codebase navigation and concepts discussion.
pt_br: Uso Github Copilot no meu trabalho atual na RDI, já que é a ferramenta de AI aprovada. Uso para geração de código, tanto para código de produção (sempre revisado por mim) e ferramentas internas, navegação na base de código e discussões sobre conceitos e melhores práticas.

# ChatGPT.YearsOfExperience
source: 2 years of experience
pt_br: 2 anos de experiência

# ChatGPT.Text
source: I've integrated ChatGPT in my daily life as a learning tool, summarizing information, coding assistant in my side-projects, finding improvements opportunities that I might miss in my skills and career and as an overall boring stuff automation tool.
pt_br: Eu integrei o ChatGPT na minha rotina como uma ferramenta de aprendizado, resumidor de informações, assistente de codificação nos meus projetos pessoais, para encontrar oportunidades de melhoria que eu posso deixar passar em minhas habilidades e carreira e também como uma ferramente de automação geral.

# TeamCity.YearsOfExperience
source: 4 years of experience
pt_br: 4 anos de experiência

# TeamCity.Text
source: TeamCity is the official CI/CD tool at RDI, and I've used it continuously for the past 4 years.
pt_br: TeamCity é a ferramenta de CI/CD oficial na RDI, e eu tenho usado continuamente pelos últimos 4 anos.

# Make.YearsOfExperience
source: 2 years of experience
pt_br: 2 anos de experiência

# Make.Text
source: At Gertec, Make was used to build the embedded software for both the bare-metal and linux devices.
pt_br: Na Gertec, usei Make para fazer o build the software embarcado em linux e bare-metal.

# Scrum.YearsOfExperience
source: 10 years of experience
pt_br: 10 anos de experiência
